# ScheduleFieldId Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ScheduleFieldId Properties
ScheduleFieldId Class See Also
---
The ScheduleFieldId type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IntegerValue | Provides the value of the ScheduleFieldId as an integer. |
| InvalidScheduleFieldId | Get the invalid ScheduleFieldId whose IntegerValue is -1. |

# See Also
ScheduleFieldId Class
Autodesk.Revit.DB Namespace